In [1]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000029FD4AE3A08>

In [2]:
mycursor = mydb.cursor()

name = 'Cars' # it doesn't work.
year = 2006

sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE Year BETWEEN 2000 AND 2010
"""

In [3]:
import pandas as pd

sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year BETWEEN 2000 AND 2010
"""

pd.read_sql_query(sql,mydb)

             Title        Director
0   Monsters, Inc.     Pete Docter
1     Finding Nemo  Andrew Stanton
2  The Incredibles       Brad Bird
3             Cars   John Lasseter
4      Ratatouille       Brad Bird
5           WALL-E  Andrew Stanton
6               Up     Pete Docter

In [4]:
sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE id = 6
"""
pd.read_sql_query(sql,mydb)

  Title       Director
0  Cars  John Lasseter

In [5]:
sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year BETWEEN 2000 AND 2010
"""
pd.read_sql_query(sql,mydb)

             Title        Director
0   Monsters, Inc.     Pete Docter
1     Finding Nemo  Andrew Stanton
2  The Incredibles       Brad Bird
3             Cars   John Lasseter
4      Ratatouille       Brad Bird
5           WALL-E  Andrew Stanton
6               Up     Pete Docter

In [6]:
sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year NOT BETWEEN 2000 AND 2010
"""
pd.read_sql_query(sql,mydb)

          Title       Director
0  A Bug's Life  John Lasseter
1   Toy Story 2  John Lasseter

In [7]:
sql = f"""
SELECT title, director, year
FROM sql_lesson_1_movies
WHERE id BETWEEN 1 AND 5
"""
pd.read_sql_query(sql,mydb)

             title        director  year
0     A Bug's Life   John Lasseter  1998
1      Toy Story 2   John Lasseter  1999
2   Monsters, Inc.     Pete Docter  2001
3     Finding Nemo  Andrew Stanton  2003
4  The Incredibles       Brad Bird  2004

In [8]:
sql = f"""
SELECT title, year
FROM sql_lesson_1_movies
WHERE director = "John Lasseter"
"""
pd.read_sql_query(sql, mydb)

          title  year
0  A Bug's Life  1998
1   Toy Story 2  1999
2          Cars  2006

In [9]:
sql = f"""
SELECT title, year
FROM sql_lesson_1_movies
WHERE director != "John Lasseter"
"""
pd.read_sql_query(sql, mydb)

             title  year
0   Monsters, Inc.  2001
1     Finding Nemo  2003
2  The Incredibles  2004
3      Ratatouille  2007
4           WALL-E  2008
5               Up  2009

In [11]:
sql = f"""
SELECT title, year
FROM sql_lesson_1_movies
WHERE director LIKE "%John Lasseter%"
"""
pd.read_sql_query(sql, mydb)

          title  year
0  A Bug's Life  1998
1   Toy Story 2  1999
2          Cars  2006

In [15]:
sql = f"""
SELECT title, director
FROM sql_lesson_1_movies
WHERE director NOT LIKE "%John Lasseter%"
"""
pd.read_sql_query(sql, mydb)

             title        director
0   Monsters, Inc.     Pete Docter
1     Finding Nemo  Andrew Stanton
2  The Incredibles       Brad Bird
3      Ratatouille       Brad Bird
4           WALL-E  Andrew Stanton
5               Up     Pete Docter

In [17]:
sql = f"""
SELECT title, director
FROM sql_lesson_1_movies
WHERE director LIKE "%asse%"
"""
pd.read_sql_query(sql, mydb)

          title       director
0  A Bug's Life  John Lasseter
1   Toy Story 2  John Lasseter
2          Cars  John Lasseter